---
kind: property
id: P:Autodesk.Revit.DB.Electrical.CableTraySettings.SizeSeparator
source: html/0e0cdd4f-d8f3-4f8e-7a60-c84736af70a3.htm
---
# Autodesk.Revit.DB.Electrical.CableTraySettings.SizeSeparator Property

The cable tray size separator string.

## Syntax (C#)
```csharp
public string SizeSeparator { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null